# Import Libraries

In [1]:
import numpy as np
import pandas as pd

# Data Cleaning

In [2]:
df = pd.DataFrame({
    "name": ["babar", "babar", "zeeshan"],
    "toy": [np.nan, "Bat", "Football"],
    "born": [pd.NaT, pd.Timestamp("2000-4-25"), pd.NaT]
})
df

      name       toy       born
0    babar       NaN        NaT
1    babar       Bat 2000-04-25
2  zeeshan  Football        NaT

In [3]:

drop_na = df.dropna(how='all', axis=1)
drop_na

      name       toy       born
0    babar       NaN        NaT
1    babar       Bat 2000-04-25
2  zeeshan  Football        NaT

In [4]:

drop_duplicates = df.drop_duplicates(subset=["name"], keep="last")
drop_duplicates

      name       toy       born
1    babar       Bat 2000-04-25
2  zeeshan  Football        NaT

In [5]:
df_info = df.info()
df_info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [6]:

value_counts = df['name'].value_counts(dropna=True)
value_counts

name
babar      2
zeeshan    1
Name: count, dtype: int64

In [7]:
not_null = df.notnull()
not_null

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

# Exercise

In [8]:
data = np.array([[10, 5], [20, 15], [30, 25]])
df = pd.DataFrame(data, columns=['A', 'B'])

print("DataFrame:")
print(df)

print("\ndf.describe():")
print(df.describe())

print("\ndf.mean():")
print(df.mean())

print("\ndf.corr():")
print(df.corr())

print("\ndf.count():")
print(df.count())

print("\ndf.median():")
print(df.median())

print("\ndf.min():")
print(df.min())

print("\ndf.max():")
print(df.max())

print("\ndf.std():")
print(df.std())

DataFrame:
    A   B
0  10   5
1  20  15
2  30  25

df.describe():
          A     B
count   3.0   3.0
mean   20.0  15.0
std    10.0  10.0
min    10.0   5.0
25%    15.0  10.0
50%    20.0  15.0
75%    25.0  20.0
max    30.0  25.0

df.mean():
A    20.0
B    15.0
dtype: float64

df.corr():
     A    B
A  1.0  1.0
B  1.0  1.0

df.count():
A    3
B    3
dtype: int64

df.median():
A    20.0
B    15.0
dtype: float64

df.min():
A    10
B     5
dtype: int64

df.max():
A    30
B    25
dtype: int64

df.std():
A    10.0
B    10.0
dtype: float64